[
  {
    "id": "1",
    "title": "Artificial Intelligence & Machine Learning",
    "description": "This course provides a comprehensive introduction to Artificial Intelligence and Machine Learning, covering fundamentals like neural networks, supervised and unsupervised learning, and practical applications using tools like TensorFlow and Python. Students will engage in interactive labs, build AI models, and explore real-world projects, including generative AI, to deploy cutting-edge technology. Gain insight into the principles of data and technologies that frame and define cybersecurity, with a focus on the latest advancements in AI technologies and hands-on experience with Gen AI projects.",
    "image": "assets/images/ai.jpg",
    "role": "AI Engineer",
    "duration": "8 weeks",
    "level": "Intermediate",
    "instructor": "Dr. Sarah Johnson",
    "skills": ["Python", "TensorFlow", "Neural Networks"],
    "scholarship": "Available",
    "fee": "$500",
    "location": "Online",
    "lastDateToApply": "2025-11-15",
    "startdate": "2025-12-01",
    "enddate": "2026-01-26",
    "eligibility": "Basic programming knowledge"
  },
  {
    "id": "2",
    "title": "Data Science with Python",
    "description": "Dive into data science using Python, learning data manipulation with Pandas, visualization with Matplotlib and Seaborn, and machine learning with Scikit-learn. The course includes hands-on practice with real datasets, covering best practices and workflows for analysis, predictive modeling, and more, suitable for beginners building foundational skills. Learn the basics of programming in Python, from zero to programming, and gain a fundamental understanding of data processing, visualization techniques, and machine learning concepts.",
    "image": "assets/images/data_science.jpg",
    "role": "Data Scientist",
    "duration": "6 weeks",
    "level": "Beginner",
    "instructor": "Prof. Michael Lee",
    "skills": ["Python", "Pandas", "Matplotlib"],
    "scholarship": "Not Available",
    "fee": "$400",
    "location": "Online",
    "lastDateToApply": "2025-11-10",
    "startdate": "2025-11-20",
    "enddate": "2025-12-31",
    "eligibility": "No prior experience required"
  },
  {
    "id": "3",
    "title": "Cybersecurity Fundamentals",
    "description": "Explore the basics of cybersecurity, including network security, cryptography, ethical hacking, and threat mitigation. The course covers fundamental concepts to protect against cyberattacks, with hands-on insight into data protection, security management, and real-world applications for personal and business safety. Learn cybersecurity basics, cryptography, and security management, with a focus on principles of data and technologies that frame and define cybersecurity, including mathematics foundations for cryptography and protecting your personal digital life.",
    "image": "assets/images/cyber_security.jpg",
    "role": "Cybersecurity Analyst",
    "duration": "10 weeks",
    "level": "Intermediate",
    "instructor": "Emma Davis",
    "skills": ["Network Security", "Ethical Hacking", "Threat Analysis"],
    "scholarship": "Available",
    "fee": "$600",
    "location": "Online",
    "lastDateToApply": "2025-11-20",
    "startdate": "2025-12-05",
    "enddate": "2026-02-13",
    "eligibility": "Basic networking knowledge"
  },
  {
    "id": "4",
    "title": "UI/UX Design Mastery",
    "description": "Master UI/UX design from theory to building live websites, covering design principles, prototyping with Figma, user research, and advanced techniques. The course includes hands-on projects, self-paced lessons, and a playbook for creating polished, scalable interfaces, ideal for beginners to professionals. Learn from zero to live website, with UX/UI design mastery from theory to practice, including foundations, visual and interactive design, advanced techniques, and hands-on projects for polished interfaces.",
    "image": "assets/images/ui_ux.jpg",
    "role": "UI/UX Designer",
    "duration": "5 weeks",
    "level": "Beginner",
    "instructor": "Alex Carter",
    "skills": ["Figma", "Prototyping", "User Research"],
    "scholarship": "Not Available",
    "fee": "$350",
    "location": "Online",
    "lastDateToApply": "2025-11-05",
    "startdate": "2025-11-15",
    "enddate": "2025-12-20",
    "eligibility": "No prior experience required"
  },
  {
    "id": "5",
    "title": "Cloud Computing with AWS",
    "description": "Learn cloud computing fundamentals with AWS, covering architecture, deployment, and services like EC2 and S3. The course includes hands-on labs, lectures, and certifications, guiding beginners through web development basics to advanced cloud solutions, with over 150 labs for practical experience. Become a cloud developer in as little as 9 months with a structured path, 9 courses, 150+ labs, and 2 AWS certifications, including free digital courses curated by AWS experts.",
    "image": "assets/images/cloud.jpg",
    "role": "Cloud Engineer",
    "duration": "7 weeks",
    "level": "Advanced",
    "instructor": "Dr. Priya Sharma",
    "skills": ["AWS", "Cloud Architecture", "DevOps"],
    "scholarship": "Available",
    "fee": "$700",
    "location": "Online",
    "lastDateToApply": "2025-11-25",
    "startdate": "2025-12-10",
    "enddate": "2026-01-28",
    "eligibility": "Intermediate programming and networking"
  },
  {
    "id": "6",
    "title": "Full-Stack Web Development",
    "description": "Become a full-stack web developer by building modern apps with React, Node.js, MongoDB, and APIs. The course covers n-tier architecture, front-end/back-end development, database management, and hands-on projects for real-world coding skills, from basics to deployment. Implement web development essentials, including front-end and back-end coding, APIs, and building web applications, with a professional certificate in full-stack web development.",
    "image": "assets/images/web_dev.jpg",
    "role": "Full-Stack Developer",
    "duration": "12 weeks",
    "level": "Intermediate",
    "instructor": "James Wilson",
    "skills": ["React", "Node.js", "MongoDB"],
    "scholarship": "Available",
    "fee": "$800",
    "location": "Online",
    "lastDateToApply": "2025-12-01",
    "startdate": "2025-12-15",
    "enddate": "2026-03-10",
    "eligibility": "Basic JavaScript knowledge"
  }
]